# PaperSource Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PaperSource Class
Members See Also
---
An object that represents a Paper Source of Print Setup within the Autodesk Revit project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PaperSource : APIObject
```

Visual Basic
---
```text
Public Class PaperSource _
	Inherits APIObject
```

Visual C++
---
```text
public ref class PaperSource : public APIObject
```

# Remarks
This object derived from the APIObject base object.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..PaperSource
# See Also
PaperSource Members
Autodesk.Revit.DB Namespace